#### Pandas - DataFrame and Series

In [2]:
import pandas as pd

##### Series

In [3]:
data = [1,2,3,4,5]
series= pd.Series(data)
print("series \n",series)
print(type(series))

series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
## Creating  a Series from dictinary
data = {"A": 1, "B":2,"C":3}
series_dict=pd.Series(data)
print(series_dict)

A    1
B    2
C    3
dtype: int64

In [5]:
data  =[10,20,30]
index =["a","b","c"]
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

#### DataFrame

In [13]:
## create a dataframe for dict of list

data = {
    "Name": ["Avinash","Aditya","Rohit"],
    "Age":[25,35,20],
    "City": ["Bangalore","New york","Florida"]
    }
df =pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age       City
0  Avinash   25  Bangalore
1   Aditya   35   New york
2    Rohit   20    Florida
<class 'pandas.core.frame.DataFrame'>

In [7]:
import numpy as np
np.array(df)

array([['Avinash', 25, 'Bangalore'],
       ['Aditya', 35, 'New york'],
       ['Rohit', 20, 'Florida']], dtype=object)

In [8]:
## create a Data frame from a list of dict

data = [
     {"Name": "Avinash", "Age":25,"City":"Bangalore"},
     {"Name": "Aditya", "Age":32,"City":"New york"},
     {"Name": "Rohit", "Age":25,"City":"Florida"}
    
]

df =pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age       City
0  Avinash   25  Bangalore
1   Aditya   32   New york
2    Rohit   25    Florida
<class 'pandas.core.frame.DataFrame'>

#### Accessing data from DataFrame

In [14]:
df

      Name  Age       City
0  Avinash   25  Bangalore
1   Aditya   35   New york
2    Rohit   20    Florida

In [15]:
df["Name"]

0    Avinash
1     Aditya
2      Rohit
Name: Name, dtype: object

In [17]:
print(type(df["Name"]))

<class 'pandas.core.series.Series'>

In [21]:
df.loc[0][0]

C:\Users\avina\AppData\Local\Temp\ipykernel_15448\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Avinash'

In [20]:
df.iloc[1][0]

C:\Users\avina\AppData\Local\Temp\ipykernel_15448\1019881219.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][0]

'Aditya'

In [25]:
## Accessing a specified element
df.at[2,"Age"]

np.int64(20)

In [24]:
df

      Name  Age       City
0  Avinash   25  Bangalore
1   Aditya   35   New york
2    Rohit   20    Florida

In [26]:
## Accessing a specified element using iat
df.iat[2,2]

'Florida'

In [27]:
### Data manipulation with dataframe
df

      Name  Age       City
0  Avinash   25  Bangalore
1   Aditya   35   New york
2    Rohit   20    Florida

In [30]:
## Adding a column
df["salaries"] = [25,23,20]
df

      Name  Age       City  salaries
0  Avinash   25  Bangalore        25
1   Aditya   35   New york        23
2    Rohit   20    Florida        20

In [34]:
## Remove a column
df.drop("salaries",axis=1)  ## it is not parmanent operation

      Name  Age       City
0  Avinash   25  Bangalore
1   Aditya   35   New york
2    Rohit   20    Florida

In [33]:
df

      Name  Age       City  salaries
0  Avinash   25  Bangalore        25
1   Aditya   35   New york        23
2    Rohit   20    Florida        20

In [35]:
df.drop("salaries",axis=1,inplace=True)

In [36]:
df

      Name  Age       City
0  Avinash   25  Bangalore
1   Aditya   35   New york
2    Rohit   20    Florida

In [37]:
## Add age to the columns
df["Age"]=df["Age"] +1

In [38]:
df

      Name  Age       City
0  Avinash   26  Bangalore
1   Aditya   36   New york
2    Rohit   21    Florida

In [39]:
df.drop(0)

     Name  Age      City
1  Aditya   36  New york
2   Rohit   21   Florida

In [40]:
df

      Name  Age       City
0  Avinash   26  Bangalore
1   Aditya   36   New york
2    Rohit   21    Florida

In [41]:
df.drop(0,inplace=True)

In [42]:
df

     Name  Age      City
1  Aditya   36  New york
2   Rohit   21   Florida

#### Read the data

In [43]:
df =pd.read_csv("sales_data.csv")
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [44]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000